use sqlUspevatoriya
go

-- Заполнение таблицы Role (Роль)
INSERT INTO Roles (Name) VALUES 
(N'Администратор'),
(N'Преподаватель'),
(N'Студент'),
(N'Родитель')

-- Заполнение таблицы Users (Пользователи)
INSERT INTO Users (IDRoles, Name, Surname, Patronymic, Phone, IndentificstionDocument, Login, Password) VALUES 
(1, N'Иван', N'Иванов', N'Иванович', '123456789', '2451423618', 'admin1', 'adminpass1'),
(2, N'Петр', N'Петров', N'Петрович', '987654321', '2451423619', 'teacher1', 'teacherpass1'),
(3, N'Анна', N'Сидорова', N'Петровна', '555555555', '2451423620', 'student1', 'studentpass1'),
(4, N'Елена', N'Иванова', N'Сергеевна', '111111111', '2451423621', 'parent1', 'parentpass1'),
(1, N'Мария', N'Петрова', N'Ивановна', '222222222', '2451423622', 'admin2', 'adminpass2'),
(2, N'Алексей', N'Смирнов', N'Петрович', '333333333', '2451423623', 'teacher2', 'teacherpass2'),
(3, N'Дмитрий', N'Котов', N'Константинович', '444444444', '2451423624', 'student2', 'studentpass2'),
(4, N'Ольга', N'Николаева', N'Владимировна', '666666666', '2451423625', 'parent2', 'parentpass2'),
(2, N'Анатолий', N'Захаров', N'Дмитриевич', '777777777', '2451423626', 'teacher3', 'teacherpass3'),
(3, N'Евгений', N'Семенов', N'Григорьевич', '888888888', '2451423627', 'student3', 'studentpass3'),
(1, N'Александр', N'Зайцев', N'Александрович', '999999999', '2451423628', 'admin3', 'adminpass3'),
(2, N'Наталья', N'Козлова', N'Игоревна', '101010101', '2451423629', 'teacher4', 'teacherpass4'),
(3, N'Ирина', N'Иванова', N'Дмитриевна', '121212121', '2451423630', 'student4', 'studentpass4'),
(4, N'Анна', N'Смирнова', N'Петровна', '131313131', '2451423631', 'parent3', 'parentpass3'),
(1, N'Светлана', N'Кузнецова', N'Викторовна', '141414141', '2451423632', 'admin4', 'adminpass4'),
(2, N'Андрей', N'Нестеров', N'Александрович', '151515151', '2451423633', 'teacher5', 'teacherpass5'),
(3, N'Дарья', N'Попова', N'Ивановна', '161616161', '2451423634', 'student5', 'studentpass5'),
(4, N'Виктор', N'Михайлов', N'Петрович', '171717171', '2451423635', 'parent4', 'parentpass4'),
(1, N'Елена', N'Коновалова', N'Игоревна', '181818181', '2451423636', 'admin5', 'adminpass5'),
(2, N'Игорь', N'Макаров', N'Александрович', '191919191', '2451423637', 'teacher6', 'teacherpass6'),
(3, N'Кристина', N'Петрова', N'Сергеевна', '202020202', '2451423638', 'student6', 'studentpass6'),
(4, N'Мария', N'Захарова', N'Ивановна', '212121212', '2451423639', 'parent5', 'parentpass5'),
(1, N'Валентин', N'Козлов', N'Олегович', '222222222', '2451423640', 'admin6', 'adminpass6'),
(2, N'Нина', N'Петрова', N'Александровна', '232323232', '2451423641', 'teacher7', 'teacherpass7'),
(3, N'Артем', N'Соколов', N'Владимирович', '242424242', '2451423642', 'student7', 'studentpass7'),
(4, N'Евгения', N'Кузнецова', N'Сергеевна', '252525252', '2451423643', 'parent6', 'parentpass6'),
(1, N'Игорь', N'Новиков', N'Алексеевич', '262626262', '2451423644', 'admin7', 'adminpass7'),
(2, N'Анастасия', N'Иванова', N'Петровна', '272727272', '2451423645', 'teacher8', 'teacherpass8'),
(3, N'Александра', N'Сорокина', N'Игоревна', '282828282', '2451423646', 'student8', 'studentpass8'),
(4, N'Кирилл', N'Павлов', N'Сергеевич', '292929292', '2451423647', 'parent7', 'parentpass7'),
(1, N'Алексей', N'Зайцев', N'Александрович', '303030303', '2451423648', 'admin8', 'adminpass8'),
(2, N'Наталья', N'Петрова', N'Игоревна', '313131313', '2451423649', 'teacher9', 'teacherpass9'),
(3, N'Дмитрий', N'Максимов', N'Иванович', '323232323', '2451423650', 'student9', 'studentpass9'),
(4, N'Ирина', N'Захарова', N'Дмитриевна', '333333333', '2451423651', 'parent8', 'parentpass8'),
(1, N'Светлана', N'Петрова', N'Олеговна', '343434343', '2451423652', 'admin9', 'adminpass9'),
(2, N'Владимир', N'Смирнов', N'Игоревич', '353535353', '2451423653', 'teacher10', 'teacherpass10'),
(3, N'Екатерина', N'Козлова', N'Александровна', '363636363', '2451423654', 'student10', 'studentpass10'),
(4, N'Олег', N'Иванов', N'Дмитриевич', '373737373', '2451423655', 'parent9', 'parentpass9'),
(1, N'Анна', N'Сидорова', N'Игоревна', '383838383', '2451423656', 'admin10', 'adminpass10'),
(2, N'Иван', N'Петров', N'Олегович', '393939393', '2451423657', 'teacher11', 'teacherpass11');

-- Заполнение таблицы ParentsChild
INSERT INTO ParentsChild (IDParent, IDChildren) VALUES 
(4, 3),  -- Родитель: Елена Иванова, ребёнок: Анна Сидорова
(4, 31), -- Родитель: Елена Иванова, ребёнок: Валентин Козлов
(4, 32), -- Родитель: Елена Иванова, ребёнок: Наталья Петрова
(8, 33), -- Родитель: Ольга Николаева, ребёнок: Дмитрий Максимов
(8, 34), -- Родитель: Ольга Николаева, ребёнок: Ирина Захарова
(12, 35), -- Родитель: Светлана Кузнецова, ребёнок: Светлана Петрова
(16, 36), -- Родитель: Игорь Новиков, ребенок: Владимир Смирнов
(16, 37), -- Родитель: Игорь Новиков, ребенок: Екатерина Козлова
(20, 38), -- Родитель: Светлана Петрова, ребенок: Олег Иванов
(20, 39), -- Родитель: Светлана Петрова, ребенок: Анна Сидорова
(24, 40); -- Родитель: Наталья Петрова, ребенок: Иван Петров

-- Заполнение таблицы CourseName (НазваниеКурса)
INSERT INTO CourseName (Name) VALUES 
(N'Математика'),
(N'Физика'),
(N'Литература'),
(N'Химия'),
(N'История'),
(N'Биология'),
(N'География'),
(N'Информатика')

-- Заполнение таблицы Courses (Курсы)
INSERT INTO Courses (IDCourseName, IDTeacher, DateBegin, DateEnd) VALUES 
(1, 2, 2023-06-30, 2023-11-30), -- Математика, преподаватель: Наталья Козлова
(2, 6, 2023-06-30, 2023-11-30), -- Физика, преподаватель: Елена Иванова
(3, 9, 2023-06-30, 2023-11-30), -- Литература, преподаватель: Анна Сидорова
(4, 12, 2023-06-30, 2023-11-30), -- Химия, преподаватель: Валентин Козлов
(5, 16, 2023-06-30, 2023-11-30), -- История, преподаватель: Нина Петрова
(6, 20, 2023-06-30, 2023-11-30), -- Биология, преподаватель: Наталья Козлова
(7, 24, 2023-06-30, 2023-11-30), -- География, преподаватель: Елена Иванова
(8, 28, 2023-06-30, 2023-11-30), -- Иностранный язык, преподаватель: Анна Сидорова
(8, 32, 2023-06-30, 2023-11-30),
(1, 36, 2023-06-30, 2023-11-30),
(2, 40, 2023-06-30, 2023-11-30),
(3, 40, 2023-06-30, 2023-11-30),
(4, 40, 2023-06-30, 2023-11-30),
(5, 2, 2023-06-30, 2023-11-30),
(6, 2,2023-06-30, 2023-11-30),
(7, 2, 2023-06-30, 2023-11-30),
(8, 6, 2023-06-30, 2023-11-30),
(1, 9, 2023-06-30, 2023-11-30),
(2, 9, 2023-06-30, 2023-11-30),
(3, 9, 2023-06-30, 2023-11-30),
(4, 16, 2023-06-30, 2023-11-30),
(5, 24, 2023-06-30, 2023-11-30),
(6, 20, 2023-06-30, 2023-11-30),
(7, 12, 2023-06-30, 2023-11-30),
(8, 32, 2023-06-30, 2023-11-30),
(1, 36, 2023-06-30, 2023-11-30),
(2, 2, 2023-06-30, 2023-11-30),
(3, 32, 2023-06-30, 2023-11-30),
(4, 36, 2023-06-30, 2023-11-30),
(5, 2, 2023-06-30, 2023-11-30),
(6, 12, 2023-06-30, 2023-11-30),
(7, 16, 2023-06-30, 2023-11-30),
(8, 24, 2023-06-30, 2023-11-30),
(1, 28, 2023-06-30, 2023-11-30),
(2, 32, 2023-06-30, 2023-11-30),
(3, 36, 2023-06-30, 2023-11-30),
(4, 40, 2023-06-30, 2023-11-30),
(5, 2, 2023-06-30, 2023-11-30),
(6, 2, 2023-06-30, 2023-11-30);

-- Заполнение таблицы CourseStudent (СтудентыКурсы)
INSERT INTO CourseStudent (IDCourse, IDStudent) VALUES 
(1, 3), 
(1, 7),
(1, 10),
(2, 13),
(2, 10),
(2, 21),
(3, 25),
(3, 29),
(3, 33),
(4, 37),
(4, 33),
(4, 21),
(5, 3),
(5, 33),
(5, 10),
(6, 37),
(6, 33),
(6, 13),
(7, 37),
(7, 10),
(7, 33),
(8, 10),
(8, 17),
(8, 21),
(1, 33),
(1, 25),
(1, 37),
(2, 3),
(2, 37),
(2, 17),
(3, 17),
(3, 10),
(3, 3),
(4, 3),
(4, 10),
(4, 25),
(5, 37),
(5, 7),
(5, 25),
(6, 3),
(6, 25),
(7, 3),
(7, 17),
(7, 25),
(8, 7),
(8, 3),
(8, 25);

-- Заполнение таблицы Lessons (Занятия)
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(1, '2023-01-01 08:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(2, '2023-01-02 09:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(3, '2023-01-03 10:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(4, '2023-01-04 11:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(5, '2023-01-05 12:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(6, '2023-01-06 13:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(7, '2023-01-07 14:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(8, '2023-01-08 15:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(1, '2023-01-01 08:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(2, '2023-01-02 09:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(3, '2023-01-03 10:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(4, '2023-01-04 11:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(5, '2023-01-05 12:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(6, '2023-01-06 13:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(7, '2023-01-07 14:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(8, '2023-01-08 15:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(1, '2023-01-01 08:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(2, '2023-01-02 09:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(3, '2023-01-03 10:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(4, '2023-01-04 11:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(5, '2023-01-05 12:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(6, '2023-01-06 13:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(7, '2023-01-07 14:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(8, '2023-01-08 15:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(1, '2023-01-01 08:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(2, '2023-01-02 09:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(3, '2023-01-03 10:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(4, '2023-01-04 11:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(5, '2023-01-05 12:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(6, '2023-01-06 13:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(7, '2023-01-07 14:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(8, '2023-01-08 15:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(1, '2023-01-01 08:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(2, '2023-01-02 09:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(3, '2023-01-03 10:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(4, '2023-01-04 11:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(5, '2023-01-05 12:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(6, '2023-01-06 13:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(7, '2023-01-07 14:00:00')
INSERT INTO Lessons (IDCourse, DateTime) VALUES
(8, '2023-01-08 15:00:00')
